[
  {
    "text": "Hello, Camper 👋. My name is Camperbot. Click the buttons above to learn more about me..."
  },
  {
    "text": "I am your friendly assistant, and will help you with your work tasks."
  },
  {
    "text": "My family are so proud for working with you, one of brightest blockchain developers of our time."
  },
  {
    "text": "Counting all the lit up LEDs, I can see that you have 100 tokens!"
  },
  {
    "text": "Seeing as 90 of these LEDs are greenish, that makes 90/100 of your tokens staked in your Proof of Stake blockchain."
  },
  {
    "text": "I think you should stake more of your tokens to have a better chance of getting tasks. Click on one of the whiteish LEDs to stake it."
  },
  {
    "text": "Also, staking more tokens increases the chance of you gaining reputation for a correctly completed task."
  },
  {
    "text": "With reputation, you can buy more server racks to store your tokens."
  },
  {
    "text": "Being a robot, I can count the number of tokens you have very quickly. Click on my hat to get your account stats, and access the menu."
  },
  {
    "text": "Oooo! Look, Camper! A green LED has turned reddish, and your server screen is flashing! You have a new task!"
  },
  {
    "text": "Let us click on the screen to see what task you have!"
  },
  {
    "text": "Hmm... A quiz. Looks like a hard one. I hope you get it correct so we get a reward. Complete the quiz."
  },
  {
    "text": "Now that you submitted it, we will have to wait for other nodes to validate your submission."
  },
  {
    "text": "So... weird weather we have been having."
  },
  {
    "text": "Finally! Your answer has been validated."
  },
  {
    "text": "Looks like it has been accepted, and added to the blockchain!"
  },
  {
    "text": "There is your reward! Another token, and more reputation!"
  },
  {
    "text": "With 10 unstaked tokens, and an extra reputation, you can buy another server rack. Click the button to buy one!"
  },
  {
    "text": "That brings your total to... Wait! My senses are picking something up on the network..."
  },
  {
    "text": "What! Nooo! The network is being compromised! We are being hacked!"
  },
  {
    "text": "Look out!"
  },
  {
    "text": "What?! Your servers... where did they go? Someone else must have stolen them."
  },
  {
    "text": "All I managed to save is enough tokens to buy one server rack, and stake a few more."
  },
  {
    "text": "You will have to start from the beginning to get your blockchain back."
  },
  {
    "text": "Start doing tasks, staking tokens, and buying racks to get back what you lost."
  }
]
